cf_billing/Documents/энргОбходнойЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргОбходнойЛист</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.энргЗарегистрированныйОбъемПриборов</xr:Item>
				<xr:Item>InformationRegister.энргПоказанияПриборовУчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргМаршрутыКонтроллеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контроллер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПоказаний</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргИсточникиПоказаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлДляЧтения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>URLДляЧтения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргЗагрузкаПоказанийИзВнешнихИсточников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоказанияПриборовУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоследнихПоказаний</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентПУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноВозможныеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноВозможныйОбъемПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Переворот</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереворотИзмененПользователем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредыдущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеПоказаний</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргСостояниеПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднийОбъемПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусИзмененПользователем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяЗона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднийОбъемПотребления3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказанияПредоставлены</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтклонения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргПричиныОтклоненияПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтрокиТочкиУчета</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТочкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Абонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючПомещения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПримечаниеДляТУ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьАдресАбонента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШкалыПриборовУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтрокиТочкиУчета</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДифференцированности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шкала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Documents/энргОбходнойЛист/Forms/ФормаДокументаРегистрацияПоСтроению/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	энргЛокализацияСервер.ПриСозданииНаСервере_энргОбходнойЛист(ЭтотОбъект);
		
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
		яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
		энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета);
	КонецЕсли;
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
	яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
	энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета,ТекущийОбъект);
	
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"ТочкиУчета");
	
	энргРаботаСприборамиУчетаСервер.ЗаполнитьСвойствоРегистрируетОбъемПриЧтении(Объект.ТочкиУчета,ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	энргШкалыТарифныеЗоныСервер.ЗаполнитьОбъектПоПредставлениюФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
			
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"ТочкиУчета");
	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлеменитовШапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		Объект.ПериодНачисления = энргГраницыПериодаНачисленияМенеджерВызовСервера.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Объект.Район); 		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиТочкиУчета

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчетаЕстьШкалыЕстьТарифныеЗоны";
	ИмяТаблицыШкал							= "ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоны";
	ТаблицаФормыШкал	 					= Элементы[ИмяТаблицыШкал];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкал,"IDСтрокиТочкиУчета",ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }
	
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчетаЕстьШкалыНетТарифныхЗон";
	ИмяТаблицыПоказания						= "ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон";
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтроки,Неопределено,"ТочкиУчета"); 
	// энргРаботаСВидомДифференцированности }
	
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтрокиШкалы); 
	// энргРаботаСВидомДифференцированности }

	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПередУдалением(Элемент, Отказ)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	
	ТаблицыФормы				= Новый Массив;	
	ТаблицыФормы.Добавить("ШкалыПриборовУчета");
	
	ТаблицыФормыВторогоУровня	= Новый Массив;
	ТаблицыФормыВторогоУровня.Добавить("ПоказанияПриборовУчета");

	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы, "ТочкиУчета", ТаблицыФормыВторогоУровня);
КонецПроцедуры

&НаКлиенте
Процедура ПриборыУчетаРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
	//ТекущиеДанные.ПоказанияПредоставлены = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
	//ТекущиеДанные.ПоказанияПредоставлены = Истина;
КонецПроцедуры

#КонецОбласти

#Область СобытияТаблицыФормыШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыШкал	 						= "ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоны";
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоны";
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыШкал].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
	//ТекущиеДанные.ПоказанияПредоставлены = Истина;
КонецПроцедуры

#КонецОбласти

#Область СобытияТабличнойЧастиПоказанияПриборовУчета

&НаКлиенте
Процедура ПриборыУчетаТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
	//ТекущиеДанные.ПоказанияПредоставлены = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриборыУчетаПереворотПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("ПереворотИзмененПользователем",истина));	
	//ТекущиеДанные.ПоказанияПредоставлены = Истина;	
КонецПроцедуры

&НаКлиенте
Процедура ПриборыУчетаСостояниеПоказанийПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("СтатусИзмененПользователем",истина));
	//ТекущиеДанные.ПоказанияПредоставлены = Истина;	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
	//ТекущиеДанные.ПоказанияПредоставлены = Истина;
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура СтроениеПриИзменении(Элемент)
	СтроениеПриИзмененииНаСервере(); 
КонецПроцедуры

&НаСервере
Процедура СтроениеПриИзмененииНаСервере()
	Объект.Маршрут 		= Объект.Строение.МаршрутКонтроллера;
	Объект.Контроллер 	= Объект.Маршрут.Владелец; 
	
	УстановитьСвязьВыбораСтроения();
КонецПроцедуры

&НаСервере
Процедура УстановитьСвязьВыбораСтроения()
	НовыйМассив = Новый Массив();
	Если ЗначениеЗаполнено(Объект.Строение) Тогда		
		НовыйМассив.Добавить(Новый СвязьПараметраВыбора("Отбор.Ссылка", "Объект.Строение", РежимИзмененияСвязанногоЗначения.НеИзменять));
	КонецЕсли;
	Элементы["ТочкиУчета" + ПрефиксТочекУчета + "Строение"].СвязиПараметровВыбора = Новый ФиксированныйМассив(НовыйМассив);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоказания(Команда)
	ЗаполнитьПоказанияНаСервере(); 
КонецПроцедуры

#КонецОбласти

#Область СлужубныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПоказанияНаСервере()
	
	// очищаем табличную показания  	
	Объект.ШкалыПриборовУчета.Очистить();
	Объект.ПоказанияПриборовУчета.Очистить();
	Объект.ТочкиУчета.Очистить();
	
	// выводим данные по подключенным услугам и задолженности
	ОтборСтроение 								= ?(ЗначениеЗаполнено(Объект.Строение), Объект.Строение, Неопределено);
	Результат 									= энргСостояниеПриборовУчета.ДействующиеПриборыУчетаПоМаршруту(Объект.Дата, Объект.Организация, Объект.Район, Объект.Маршрут, ОтборСтроение); 
	
	Выборка  									= Результат.выбрать();
	ТекКлючПомещения							= Неопределено;
	ТекТочкаУчета 								= Неопределено;
	ТекШкала 									= Неопределено;
	IDСтрокиТочки 								= Неопределено;
	IDСтрокиШкалы 								= Неопределено;
	Пока Выборка.следующий() Цикл 
		НоваяТочка = Ложь;
		Если Не ТекКлючПомещения = Выборка.КлючПомещения Или НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда
			НоваяТочка = Истина;
			СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
			IDСтрокиТочки 						= Новый УникальныйИдентификатор;
			СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;
			СтрокаТочкиУчета.КлючПомещения 		= Выборка.КлючПомещения;
			СтрокаТочкиУчета.ТочкаУчета 		= Выборка.ТочкаУчета;
			СтрокаТочкиУчета.Услуга 			= Выборка.Услуга;
			СтрокаТочкиУчета.ПриборУчета 		= Выборка.ПриборУчета;
			СтрокаТочкиУчета.РегистрируетОбъем 	= Выборка.РегистрируетОбъем;
		КонецЕсли;
		
		Если НоваяТочка Или НЕ ТекШкала = Выборка.Шкала Тогда
			СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
			IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
			СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
			СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
			СтрокаШкалы.Шкала 					= Выборка.Шкала;
			СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
		КонецЕсли;

		СтрокаПоказаний 						= Объект.ПоказанияПриборовУчета.Добавить();
		СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
		СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона; 
		
		ТекКлючПомещения 						= Выборка.КлючПомещения;
		ТекТочкаУчета 							= Выборка.ТочкаУчета;
		ТекПрибор 								= Выборка.ПриборУчета;
	    ТекШкала 								= Выборка.Шкала
	КонецЦикла; 
	
	ТаблицаПоказанийДляЗаполнения 				= энргРаботаСПоказаниямиПриборовУчетаСервер.ТаблицаПоказаний(Объект.Организация,Объект.ТочкиУчета,Объект.ШкалыПриборовУчета,Объект.ПоказанияПриборовУчета,Объект.Район); 
	РезультатДанныеЗаполненияПоказаний 			= Обработки.энргПоказанияПриборовУчетаМенеджер.РезультатДанныеЗаполненияТаблицыПоказаний(Объект.Организация, Объект.Район, ТаблицаПоказанийДляЗаполнения,Объект.Дата, Истина);
	энргРаботаСПоказаниямиПриборовУчетаСервер.ЗаполнитьТабличнуюЧастьПоказанийПриборовУчета(РезультатДанныеЗаполненияПоказаний,ТаблицаПоказанийДляЗаполнения,Объект.ПоказанияПриборовУчета);
		
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"ТочкиУчета");
	
	Объект.ТочкиУчета.Сортировать("Строение,Помещение");
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект,Объект,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	
	ЗаполнитьАбонентов();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАбонентов()
	
	Ключи = Объект.ТочкиУчета.Выгрузить(,"КлючПомещения").ВыгрузитьКолонку("КлючПомещения");;
	КлючиАбонентов = АбонентыКлючейПомещений(Ключи);
	Для Каждого СтрТУ Из Объект.ТочкиУчета Цикл
		СтрТУ.Абонент = КлючиАбонентов.Получить(СтрТУ.КлючПомещения);
	КонецЦикла; 
	
КонецПроцедуры
 
&НаСервере
Функция АбонентыКлючейПомещений(Ключи)
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргАбоненты.Ссылка КАК Абонент,
		|	энргАбоненты.КлючПомещения КАК КлючПомещения
		|ИЗ
		|	Справочник.энргАбоненты КАК энргАбоненты
		|ГДЕ
		|	НЕ энргАбоненты.ПометкаУдаления
		|	И энргАбоненты.КлючПомещения В(&КлючПомещения)
		|	И энргАбоненты.Организация = &Организация";
	
	Запрос.УстановитьПараметр("КлючПомещения", Ключи);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат.Вставить(ВыборкаДетальныеЗаписи.КлючПомещения,ВыборкаДетальныеЗаписи.Абонент);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
 
#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
